<template>
  <div class="fotter" style>
    <v-footer class="v-footer" single-line>
      <div>
        <svg class="line"
        width="1320" 
        height="1" 
        viewBox="0 0 1720 1" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <rect 
        width="1720" 
        height="1" 
        rx="0.5" 
        fill="#D8D8D8"/>
        </svg>

        <div class="menu">
          Главная Новости Акции Каталог Доставка Оплата Контакты
          <div class="menu2">
            Личный_кабинет корзина О_компании Обратная_связь
            Политика_конфиденциальности

            <div></div>
          </div>
        </div>
        <div class="phone">
          +7 (3435) 12-34-56
        </div>
        <div class="mail">
          amkor@mail.ru
        </div>
        <svg
          class="logo"
          width="90"
          height="150px"
          viewBox="0 0 38 50"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M16.1203 0C14.4082 4.15512 12.6968 8.31024 10.9847 12.4661C13.4551 18.6158 15.9246 24.7649 18.395 30.9139C13.3962 30.9036 8.39809 30.8925 3.39926 30.8822C2.26643 33.6324 1.13284 36.3825 0 39.1334C7.13838 39.1349 14.2767 39.1364 21.4151 39.1379L26.1051 50H37.234C30.1961 33.3338 23.1582 16.6662 16.1203 0Z"
            fill="#FFA45A"
          />
        </svg>
        <svg class="a" 
        width="22" 
        height="21" 
        viewBox="0 0 22 21" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M15.223 6.93741C14.2255 5.91218 12.9615 5.39957 11.4357 5.39957C9.90977 5.39957 8.64585 5.91218 7.64833 6.93741C6.64933 7.96411 6.15205 9.23752 6.15205 10.7621C6.15205 12.2851 6.64933 13.5674 7.64833 14.6074C8.64585 15.6474 9.90977 16.1689 11.4357 16.1689C12.9615 16.1689 14.2255 15.6474 15.223 14.6074C16.222 13.5674 16.7207 12.2851 16.7207 10.7621C16.7207 9.23752 16.222 7.96411 15.223 6.93741ZM16.1924 3.72877V1.26616H21.5648V20.3008H16.1924V17.8397C14.7538 19.8916 12.8017 20.9168 10.3345 20.9168C7.45593 20.9168 5.11605 19.9345 3.31045 17.9712C1.50485 16.0079 0.602051 13.6043 0.602051 10.7621C0.602051 7.89173 1.48265 5.48672 3.24385 3.55297C5.00653 1.61627 7.28129 0.651611 10.0711 0.651611C12.8298 0.651611 14.8707 1.67536 16.1924 3.72877Z" fill="#1F191A"/>
        </svg>

        <svg class="m" 
        width="31" 
        height="21" 
        viewBox="0 0 31 21" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M0.67334 20.3007V1.26603H6.04574V3.4199C7.51538 1.57478 9.40682 0.651489 11.7275 0.651489C14.575 0.651489 16.5863 1.80819 17.7614 4.12456C19.2 1.80819 21.2394 0.651489 23.8827 0.651489C26.1131 0.651489 27.8313 1.42853 29.0361 2.97967C29.594 3.71388 29.9522 4.47615 30.115 5.26649C30.2763 6.05683 30.3562 7.08501 30.3562 8.34217V20.3007H24.9838V9.92728C24.9838 8.13978 24.6908 6.89297 24.1032 6.18978C23.5749 5.54569 22.8408 5.22217 21.901 5.22217C20.5497 5.22217 19.567 5.78058 18.9499 6.89297C18.4496 7.71285 18.201 8.9449 18.201 10.5861V20.3007H12.8286V9.92728C12.8286 8.13978 12.5355 6.89297 11.948 6.18978C11.4196 5.54569 10.6841 5.22217 9.74574 5.22217C8.3945 5.22217 7.41178 5.78058 6.79462 6.89297C6.29438 7.71285 6.04574 8.9449 6.04574 10.5861V20.3007H0.67334Z" fill="#1F191A"/>
        </svg>

        <svg class="k"
        width="21" 
        height="20" 
        viewBox="0 0 21 20" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M0.44043 0.243286H5.86315C5.85575 2.56556 5.84687 4.89079 5.83799 7.21306L12.9731 0.266922H19.932L10.9913 8.61795L20.6365 19.3001H13.5014L6.41075 11.1677L5.83799 11.6951V19.3001H0.46559C0.45819 12.9493 0.44783 6.59556 0.44043 0.243286Z" fill="#1F191A"/>
        </svg>

        <svg class="o"
        width="22" 
        height="21" 
        viewBox="0 0 22 21" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M7.13562 14.5864C8.16274 15.6411 9.43998 16.1685 10.9673 16.1685C12.4932 16.1685 13.7705 15.6411 14.7991 14.5864C15.8262 13.5301 16.3412 12.2715 16.3412 10.806C16.3412 9.31102 15.8262 8.03465 14.7991 6.98136C13.7705 5.92659 12.4932 5.3992 10.9673 5.3992C9.43998 5.3992 8.16274 5.92659 7.13562 6.98136C6.1085 8.03465 5.59346 9.31102 5.59346 10.806C5.59346 12.2715 6.1085 13.5301 7.13562 14.5864ZM10.9673 0.651245C14.1671 0.651245 16.7364 1.545 18.6752 3.3325C20.8167 5.26625 21.8897 7.7584 21.8897 10.806C21.8897 13.8226 20.8167 16.3015 18.6752 18.2352C16.7364 20.0227 14.1671 20.9165 10.9673 20.9165C7.7661 20.9165 5.19682 20.0227 3.2595 18.2352C1.11646 16.3015 0.043457 13.8226 0.043457 10.806C0.043457 7.7584 1.11646 5.26625 3.2595 3.3325C5.19682 1.545 7.7661 0.651245 10.9673 0.651245Z" fill="#1F191A"/>
        </svg>

        <svg class="r"
        width="14" 
        height="21" 
        viewBox="0 0 14 21" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M0.0288086 20.3007V1.26603H5.40121V4.12456C6.04649 2.89251 6.83977 2.01206 7.77957 1.48615C8.66165 0.929217 9.71689 0.651489 10.9512 0.651489C11.6542 0.651489 12.4194 0.799217 13.2408 1.09024L12.5363 6.10263C11.8599 5.63285 11.0237 5.39944 10.0262 5.39944C8.46925 5.39944 7.27933 5.91206 6.45941 6.93728C5.75345 7.81626 5.40121 9.22263 5.40121 11.1579V20.3007H0.0288086Z" fill="#1F191A"/>
        </svg>

        <svg class="a2"
        width="22" 
        height="21" 
        viewBox="0 0 22 21" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M15.535 6.93741C14.5375 5.91218 13.275 5.39957 11.7477 5.39957C10.2218 5.39957 8.95786 5.91218 7.96034 6.93741C6.96134 7.96411 6.46406 9.23752 6.46406 10.7621C6.46406 12.2851 6.96134 13.5674 7.96034 14.6074C8.95786 15.6474 10.2218 16.1689 11.7477 16.1689C13.275 16.1689 14.5375 15.6474 15.535 14.6074C16.534 13.5674 17.0327 12.2851 17.0327 10.7621C17.0327 9.23752 16.534 7.96411 15.535 6.93741ZM16.5044 3.72877V1.26616H21.8768V20.3008H16.5044V17.8397C15.0658 19.8916 13.1137 20.9168 10.6465 20.9168C7.76942 20.9168 5.42806 19.9345 3.62246 17.9712C1.81538 16.0079 0.914062 13.6043 0.914062 10.7621C0.914062 7.89173 1.79614 5.48672 3.55586 3.55297C5.31854 1.61627 7.5933 0.651611 10.3831 0.651611C13.1433 0.651611 15.1842 1.67536 16.5044 3.72877Z" fill="#57585B"/>
        </svg>

        <svg class="u"
        width="20" 
        height="20" 
        viewBox="0 0 20 20" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M0.986084 0.266357H6.35996V11.0372C6.35996 12.5602 6.7418 13.6726 7.504 14.3773C8.23808 15.0214 9.14828 15.3434 10.2346 15.3434C11.3209 15.3434 12.2326 15.0214 12.9652 14.3773C13.7289 13.6726 14.1107 12.5602 14.1107 11.0372V0.266357H19.4831V11.9161C19.4831 14.4659 18.7061 16.4144 17.1506 17.7632C15.5049 19.1976 13.2005 19.917 10.2346 19.917C7.26868 19.917 4.96432 19.1976 3.32004 17.7632C1.76308 16.4144 0.986084 14.4659 0.986084 11.9161V0.266357Z" fill="#57585B"/>
        </svg>

        <svg class="t"
        width="12" 
        height="27" 
        viewBox="0 0 12 27" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M11.6646 11.8367H7.96461V26.3007H2.59221V11.8367H0.477295V7.26604H2.59221V0.760132H7.96461V7.26604H11.6646V11.8367Z" fill="#57585B"/>
        </svg>

        <svg class="o2"
        width="23" 
        height="21" 
        viewBox="0 0 23 21" 
        fill="none" 
        xmlns="http://www.w3.org/2000/svg">
        <path 
        fill-rule="evenodd" 
        clip-rule="evenodd" 
        d="M7.60386 14.5864C8.63098 15.6411 9.90822 16.1685 11.4356 16.1685C12.9615 16.1685 14.2387 15.6411 15.2673 14.5864C16.2944 13.5301 16.8095 12.2715 16.8095 10.806C16.8095 9.31102 16.2944 8.03465 15.2673 6.98136C14.2387 5.92659 12.9615 5.3992 11.4356 5.3992C9.90822 5.3992 8.63098 5.92659 7.60386 6.98136C6.57674 8.03465 6.06318 9.31102 6.06318 10.806C6.06318 12.2715 6.57674 13.5301 7.60386 14.5864ZM11.4356 0.651245C14.6353 0.651245 17.2046 1.545 19.1434 3.3325C21.285 5.26625 22.358 7.7584 22.358 10.806C22.358 13.8226 21.285 16.3015 19.1434 18.2352C17.2046 20.0227 14.6353 20.9165 11.4356 20.9165C8.23434 20.9165 5.66506 20.0227 3.72922 18.2352C1.5847 16.3015 0.513184 13.8226 0.513184 10.806C0.513184 7.7584 1.5847 5.26625 3.72922 3.3325C5.66506 1.545 8.23434 0.651245 11.4356 0.651245Z" fill="#57585B"/>
        </svg>

      </div>
      <div class="text2">
        центр
        <br />
        подбора
        <br />
        автозапчастей
      </div>
      <div class="text-footer1">
        ООО «Амкоравто Урал»
        <br />
        <br />
        633 044 Россия, Свердловская область
        <br />
        г. Нижний Тагил
        <br />
        ул. Аграркова, дом 54 «А»
        <br />
        <br />
        ИНН 1234567890
      </div>
    </v-footer>
  </div>
</template>

<script>
export default {
  name: "fotter",

  data: () => ({}),
};
</script>

<style scoped>
.v-footer {
  background: #f3f3f3;
  position: absolute;
  width: 1920px;
  height: 780px;
  left: 0px;
  top: 3820px;
}

.text-footer1 {
  font-family: TT;
  position: absolute;
  color: #686d79;
  margin-left: 36vw;
  size: 20px;
  font-weight: 622px;
  font-size: 17px;
  height: 178px;
  word-spacing: 1;
  top: 470px;
}
.phone {
  font-family: TT Commons;
  position: absolute;
  color: #686D79;
  size: 20px;
  font-weight: 622px;
  font-size: 22px;
  height: 178px;
  word-spacing: 1;
  top: 465px;
  left: 950px;
}

.mail {
  font-family: TT Commons;
  position: absolute;
  color: #686D79;
  size: 20px;
  font-weight: 622px;
  font-size: 22px;
  height: 178px;
  word-spacing: 1;
  top: 510px;
  left: 950px;
}

.logo {
  position: absolute;
  left: 100px;
  top: 460px;
}

.a {
  position: absolute;
  left: 114px;
  top: 535px;
}

.m {
  position: absolute;
  top: 535px;
  left: 140px;
}

.k {
  position: absolute;
  top: 536px;
  left: 175px;
}

.o {
  position: absolute;
  top: 535px;
  left: 195px;
}

.r {
  position: absolute;
  top: 535px;
  left: 220px;
}

.a2 {
  position: absolute;
  top: 535px;
  left: 235px;
}

.u{
  position: absolute;
  top: 536px;
  left: 260px;
}

.t {
  position: absolute;
  top: 529px;
  left: 283px;
}

.o2 {
  position: absolute;
  top: 535px;
  left: 296px;
}

.text2 {
  font-family: Arial Black;
  position: absolute;
  color: #1F191A;
  top: 560px;
  left: 200px;
  font-size: 10px;
  word-spacing: 0;
  line-height: 12px;
}

.line {
  position: absolute;
  top: 93px;
  left: 100px;
}

.menu {
  font-family: TT Commons;
  position: absolute;
  color: #686d79;
  margin-left: 100px;
  word-spacing: 5vw;
  size: 20px;
  font-weight: 600;
  font-size: 22px;
  line-height: 10px;
  height: 235px;
  top: 124px;
}
.menu2 {
  font-family: TT Commons;
  position: absolute;
  top: 75px;
  font-size: 15px;
  word-spacing: 60px;
}
</style>